content/recipe/guacamole.md
---
title: "Guacamole"
author: ["Trev"]
lastmod: 2022-05-30T11:03:39-07:00
categories: ["side"]
draft: false
servings: 4
prep-time: 10
cook-time: 0
ready-in: 10
source-url: "https://www.allrecipes.com/recipe/14231/guacamole/"
---

## Ingredients {#ingredients}

-   3 avocados - peeled, pitted, and mashed
-   1 lime, juiced
-   1 teaspoon salt
-   1/2 cup diced onion
-   3 tablespoons chopped fresh cilantro
-   2 roma (plum) tomatoes, diced
-   1 teaspoon minced garlic
-   1 pinch ground cayenne pepper


## Directions {#directions}

1.  In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately.